ahmed_body/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

#include        "include/initialConditions"

internalField   uniform $pressure;

boundaryField
{
    // Inlet
    X_min
    {
        type            zeroGradient;
    }

    // Outlet
    X_max
    {
        type            fixedValue;
        value           $internalField;
    }

    // Floor
    Z_min
    {
        type            zeroGradient;
    }

    // Top and walls
    "(Z_max|Y_min|Y_max)"
    {
        type            symmetryPlane;
    }

    ahmed_body
    {
        type            zeroGradient;
    }
    "leg_(FL|FR|RL|RR)"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
