ahmed_body/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    // Inlet
    X_min
    {
        type            calculated;
        value           $internalField;
    }

    // Outlet
    X_max
    {
        type            calculated;
        value           $internalField;
    }

    // Floor
    Z_min
    {
        type            nutkWallFunction;
        value           $internalField;
    }

    // Top and walls
    "(Z_max|Y_min|Y_max)"
    {
        type            symmetryPlane;
    }

    ahmed_body
    {
        type            nutkWallFunction;
        value           $internalField;
    }
    "leg_(FL|FR|RL|RR)"
    {
        type            nutkWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
