ahmed_body/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ahmed_body
{
    surfaces
    (
        "ahmed_body_25_deg.stl"
    );

    // Identify a feature when angle between faces < includedAngle
    includedAngle   120;

    // Do not mark region edges
    geometricTestOnly       yes;

    // Write options

    // Write features to obj format for postprocessing
    writeObj                yes;
    verboseObj              no;
}

// ************************************************************************* //
